; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	image0 - mode
	infrared1 - mode
	Star0 - direction
	GroundStation4 - direction
	Star3 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star3)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
	(supports instrument3 image0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation5)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument4 image0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star3)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star8)
	(supports instrument5 image0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 GroundStation5)
	(supports instrument6 image0)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation4)
	(supports instrument7 image0)
	(supports instrument7 infrared1)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 GroundStation4)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
	(supports instrument8 image0)
	(calibration_target instrument8 Star3)
	(supports instrument9 infrared1)
	(calibration_target instrument9 GroundStation2)
	(calibration_target instrument9 GroundStation5)
	(supports instrument10 image0)
	(calibration_target instrument10 GroundStation1)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation1)
)
(:goal (and
	(pointing satellite2 Planet10)
	(pointing satellite3 Phenomenon7)
	(have_image Star6 infrared1)
	(have_image Phenomenon7 image0)
	(have_image Star8 infrared1)
	(have_image Star9 image0)
	(have_image Planet10 image0)
))

)

; plan
1. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 7
2. (calibrate satellite3 instrument5 star0)
   added: (calibrated instrument5)
   goals met: 0 of 7
3. (turn_to satellite3 star8 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 star8)
   goals met: 0 of 7
4. (take_image satellite3 star8 instrument5 infrared1)
   added: (have_image star8 infrared1)
   goals met: 1 of 7
5. (turn_to satellite3 star6 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 star6)
   goals met: 1 of 7
6. (take_image satellite3 star6 instrument5 infrared1)
   added: (have_image star6 infrared1)
   goals met: 2 of 7
7. (turn_to satellite3 planet10 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 planet10)
   goals met: 2 of 7
8. (take_image satellite3 planet10 instrument5 image0)
   added: (have_image planet10 image0)
   goals met: 3 of 7
9. (turn_to satellite2 planet10 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 planet10)
   goals met: 4 of 7
10. (turn_to satellite3 star9 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 star9)
   goals met: 4 of 7
11. (take_image satellite3 star9 instrument5 image0)
   added: (have_image star9 image0)
   goals met: 5 of 7
12. (turn_to satellite3 phenomenon7 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 phenomenon7)
   goals met: 6 of 7
13. (take_image satellite3 phenomenon7 instrument5 image0)
   added: (have_image phenomenon7 image0)
   goals met: 7 of 7
